; domain
( DEFINE ( DOMAIN FLOOR-TILE )
( :REQUIREMENTS :CONDITIONAL-EFFECTS :TYPING )
( :TYPES
	ROBOT - OBJECT
	TILE - OBJECT
	COLOR - OBJECT
)
( :PREDICATES
	( ROBOT-AT ?ROBOT0 - ROBOT ?TILE1 - TILE )
	( UP ?TILE0 - TILE ?TILE1 - TILE )
	( DOWN ?TILE0 - TILE ?TILE1 - TILE )
	( RIGHT ?TILE0 - TILE ?TILE1 - TILE )
	( LEFT ?TILE0 - TILE ?TILE1 - TILE )
	( CLEAR ?TILE0 - TILE )
	( PAINTED ?TILE0 - TILE ?COLOR1 - COLOR )
	( ROBOT-HAS ?ROBOT0 - ROBOT ?COLOR1 - COLOR )
	( AVAILABLE-COLOR ?COLOR0 - COLOR )
	( FREE-COLOR ?ROBOT0 - ROBOT )
)
( :ACTION CHANGE-COLOR
  :PARAMETERS ( ?ROBOT0 - ROBOT ?COLOR1 - COLOR ?COLOR2 - COLOR )
  :PRECONDITION
	( AND
		( ROBOT-HAS ?ROBOT0 ?COLOR1 )
		( AVAILABLE-COLOR ?COLOR2 )
	)
  :EFFECT
	( AND
		( ROBOT-HAS ?ROBOT0 ?COLOR2 )
		( NOT ( ROBOT-HAS ?ROBOT0 ?COLOR1 ) )
	)
)
( :ACTION PAINT-UP
  :PARAMETERS ( ?ROBOT0 - ROBOT ?TILE1 - TILE ?TILE2 - TILE ?COLOR3 - COLOR )
  :PRECONDITION
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE2 )
		( CLEAR ?TILE1 )
		( ROBOT-HAS ?ROBOT0 ?COLOR3 )
		( UP ?TILE1 ?TILE2 )
	)
  :EFFECT
	( AND
		( PAINTED ?TILE1 ?COLOR3 )
		( NOT ( CLEAR ?TILE1 ) )
	)
)
( :ACTION PAINT-DOWN
  :PARAMETERS ( ?ROBOT0 - ROBOT ?TILE1 - TILE ?TILE2 - TILE ?COLOR3 - COLOR )
  :PRECONDITION
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE2 )
		( CLEAR ?TILE1 )
		( ROBOT-HAS ?ROBOT0 ?COLOR3 )
		( DOWN ?TILE1 ?TILE2 )
	)
  :EFFECT
	( AND
		( PAINTED ?TILE1 ?COLOR3 )
		( NOT ( CLEAR ?TILE1 ) )
	)
)
( :ACTION UP
  :PARAMETERS ( ?ROBOT0 - ROBOT ?TILE1 - TILE ?TILE2 - TILE )
  :PRECONDITION
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE1 )
		( CLEAR ?TILE2 )
		( UP ?TILE2 ?TILE1 )
	)
  :EFFECT
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE2 )
		( CLEAR ?TILE1 )
		( NOT ( ROBOT-AT ?ROBOT0 ?TILE1 ) )
		( NOT ( CLEAR ?TILE2 ) )
	)
)
( :ACTION DOWN
  :PARAMETERS ( ?ROBOT0 - ROBOT ?TILE1 - TILE ?TILE2 - TILE )
  :PRECONDITION
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE1 )
		( CLEAR ?TILE2 )
		( DOWN ?TILE2 ?TILE1 )
	)
  :EFFECT
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE2 )
		( CLEAR ?TILE1 )
		( NOT ( ROBOT-AT ?ROBOT0 ?TILE1 ) )
		( NOT ( CLEAR ?TILE2 ) )
	)
)
( :ACTION RIGHT
  :PARAMETERS ( ?ROBOT0 - ROBOT ?TILE1 - TILE ?TILE2 - TILE )
  :PRECONDITION
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE1 )
		( CLEAR ?TILE2 )
		( RIGHT ?TILE2 ?TILE1 )
	)
  :EFFECT
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE2 )
		( CLEAR ?TILE1 )
		( NOT ( ROBOT-AT ?ROBOT0 ?TILE1 ) )
		( NOT ( CLEAR ?TILE2 ) )
	)
)
( :ACTION LEFT
  :PARAMETERS ( ?ROBOT0 - ROBOT ?TILE1 - TILE ?TILE2 - TILE )
  :PRECONDITION
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE1 )
		( CLEAR ?TILE2 )
		( LEFT ?TILE2 ?TILE1 )
	)
  :EFFECT
	( AND
		( ROBOT-AT ?ROBOT0 ?TILE2 )
		( CLEAR ?TILE1 )
		( NOT ( ROBOT-AT ?ROBOT0 ?TILE1 ) )
		( NOT ( CLEAR ?TILE2 ) )
	)
)
)

; problem
( DEFINE ( PROBLEM P1 )
( :DOMAIN FLOOR-TILE )
( :OBJECTS
	ROBOT1 ROBOT2 - ROBOT
	TILE_0-1 TILE_0-2 TILE_0-3 TILE_0-4 TILE_1-1 TILE_1-2 TILE_1-3 TILE_1-4 TILE_2-1 TILE_2-2 TILE_2-3 TILE_2-4 TILE_3-1 TILE_3-2 TILE_3-3 TILE_3-4 TILE_4-1 TILE_4-2 TILE_4-3 TILE_4-4 - TILE
	WHITE BLACK - COLOR
)
( :INIT
	( ROBOT-AT ROBOT1 TILE_3-3 )
	( ROBOT-HAS ROBOT1 WHITE )
	( ROBOT-AT ROBOT2 TILE_0-1 )
	( ROBOT-HAS ROBOT2 BLACK )
	( AVAILABLE-COLOR WHITE )
	( AVAILABLE-COLOR BLACK )
	( CLEAR TILE_0-2 )
	( CLEAR TILE_0-3 )
	( CLEAR TILE_0-4 )
	( CLEAR TILE_1-1 )
	( CLEAR TILE_1-2 )
	( CLEAR TILE_1-3 )
	( CLEAR TILE_1-4 )
	( CLEAR TILE_2-1 )
	( CLEAR TILE_2-2 )
	( CLEAR TILE_2-3 )
	( CLEAR TILE_2-4 )
	( CLEAR TILE_3-1 )
	( CLEAR TILE_3-2 )
	( CLEAR TILE_3-4 )
	( CLEAR TILE_4-1 )
	( CLEAR TILE_4-2 )
	( CLEAR TILE_4-3 )
	( CLEAR TILE_4-4 )
	( UP TILE_1-1 TILE_0-1 )
	( UP TILE_1-2 TILE_0-2 )
	( UP TILE_1-3 TILE_0-3 )
	( UP TILE_1-4 TILE_0-4 )
	( UP TILE_2-1 TILE_1-1 )
	( UP TILE_2-2 TILE_1-2 )
	( UP TILE_2-3 TILE_1-3 )
	( UP TILE_2-4 TILE_1-4 )
	( UP TILE_3-1 TILE_2-1 )
	( UP TILE_3-2 TILE_2-2 )
	( UP TILE_3-3 TILE_2-3 )
	( UP TILE_3-4 TILE_2-4 )
	( UP TILE_4-1 TILE_3-1 )
	( UP TILE_4-2 TILE_3-2 )
	( UP TILE_4-3 TILE_3-3 )
	( UP TILE_4-4 TILE_3-4 )
	( DOWN TILE_0-1 TILE_1-1 )
	( DOWN TILE_0-2 TILE_1-2 )
	( DOWN TILE_0-3 TILE_1-3 )
	( DOWN TILE_0-4 TILE_1-4 )
	( DOWN TILE_1-1 TILE_2-1 )
	( DOWN TILE_1-2 TILE_2-2 )
	( DOWN TILE_1-3 TILE_2-3 )
	( DOWN TILE_1-4 TILE_2-4 )
	( DOWN TILE_2-1 TILE_3-1 )
	( DOWN TILE_2-2 TILE_3-2 )
	( DOWN TILE_2-3 TILE_3-3 )
	( DOWN TILE_2-4 TILE_3-4 )
	( DOWN TILE_3-1 TILE_4-1 )
	( DOWN TILE_3-2 TILE_4-2 )
	( DOWN TILE_3-3 TILE_4-3 )
	( DOWN TILE_3-4 TILE_4-4 )
	( RIGHT TILE_0-2 TILE_0-1 )
	( RIGHT TILE_0-3 TILE_0-2 )
	( RIGHT TILE_0-4 TILE_0-3 )
	( RIGHT TILE_1-2 TILE_1-1 )
	( RIGHT TILE_1-3 TILE_1-2 )
	( RIGHT TILE_1-4 TILE_1-3 )
	( RIGHT TILE_2-2 TILE_2-1 )
	( RIGHT TILE_2-3 TILE_2-2 )
	( RIGHT TILE_2-4 TILE_2-3 )
	( RIGHT TILE_3-2 TILE_3-1 )
	( RIGHT TILE_3-3 TILE_3-2 )
	( RIGHT TILE_3-4 TILE_3-3 )
	( RIGHT TILE_4-2 TILE_4-1 )
	( RIGHT TILE_4-3 TILE_4-2 )
	( RIGHT TILE_4-4 TILE_4-3 )
	( LEFT TILE_0-1 TILE_0-2 )
	( LEFT TILE_0-2 TILE_0-3 )
	( LEFT TILE_0-3 TILE_0-4 )
	( LEFT TILE_1-1 TILE_1-2 )
	( LEFT TILE_1-2 TILE_1-3 )
	( LEFT TILE_1-3 TILE_1-4 )
	( LEFT TILE_2-1 TILE_2-2 )
	( LEFT TILE_2-2 TILE_2-3 )
	( LEFT TILE_2-3 TILE_2-4 )
	( LEFT TILE_3-1 TILE_3-2 )
	( LEFT TILE_3-2 TILE_3-3 )
	( LEFT TILE_3-3 TILE_3-4 )
	( LEFT TILE_4-1 TILE_4-2 )
	( LEFT TILE_4-2 TILE_4-3 )
	( LEFT TILE_4-3 TILE_4-4 )
)
( :GOAL
	( AND
		( PAINTED TILE_1-1 WHITE )
		( PAINTED TILE_1-2 BLACK )
		( PAINTED TILE_1-3 WHITE )
		( PAINTED TILE_1-4 BLACK )
		( PAINTED TILE_2-1 BLACK )
		( PAINTED TILE_2-2 WHITE )
		( PAINTED TILE_2-3 BLACK )
		( PAINTED TILE_2-4 WHITE )
		( PAINTED TILE_3-1 WHITE )
		( PAINTED TILE_3-2 BLACK )
		( PAINTED TILE_3-3 WHITE )
		( PAINTED TILE_3-4 BLACK )
		( PAINTED TILE_4-1 BLACK )
		( PAINTED TILE_4-2 WHITE )
		( PAINTED TILE_4-3 BLACK )
		( PAINTED TILE_4-4 WHITE )
	)
)
)

; plan
1. (up robot2 tile_0-1 tile_1-1)
   deleted: (robot-at robot2 tile_0-1) (clear tile_1-1)
   added: (robot-at robot2 tile_1-1) (clear tile_0-1)
   goals met: 0 of 16
2. (up robot2 tile_1-1 tile_2-1)
   deleted: (robot-at robot2 tile_1-1) (clear tile_2-1)
   added: (robot-at robot2 tile_2-1) (clear tile_1-1)
   goals met: 0 of 16
3. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 0 of 16
4. (paint-up robot1 tile_4-3 tile_3-3 black)
   deleted: (clear tile_4-3)
   added: (painted tile_4-3 black)
   goals met: 1 of 16
5. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 1 of 16
6. (right robot1 tile_3-3 tile_3-4)
   deleted: (robot-at robot1 tile_3-3) (clear tile_3-4)
   added: (robot-at robot1 tile_3-4) (clear tile_3-3)
   goals met: 1 of 16
7. (paint-up robot1 tile_4-4 tile_3-4 white)
   deleted: (clear tile_4-4)
   added: (painted tile_4-4 white)
   goals met: 2 of 16
8. (up robot2 tile_2-1 tile_3-1)
   deleted: (robot-at robot2 tile_2-1) (clear tile_3-1)
   added: (robot-at robot2 tile_3-1) (clear tile_2-1)
   goals met: 2 of 16
9. (paint-up robot2 tile_4-1 tile_3-1 black)
   deleted: (clear tile_4-1)
   added: (painted tile_4-1 black)
   goals met: 3 of 16
10. (down robot2 tile_3-1 tile_2-1)
   deleted: (robot-at robot2 tile_3-1) (clear tile_2-1)
   added: (robot-at robot2 tile_2-1) (clear tile_3-1)
   goals met: 3 of 16
11. (down robot1 tile_3-4 tile_2-4)
   deleted: (robot-at robot1 tile_3-4) (clear tile_2-4)
   added: (robot-at robot1 tile_2-4) (clear tile_3-4)
   goals met: 3 of 16
12. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 3 of 16
13. (paint-up robot2 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 4 of 16
14. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 4 of 16
15. (paint-up robot1 tile_3-4 tile_2-4 black)
   deleted: (clear tile_3-4)
   added: (painted tile_3-4 black)
   goals met: 5 of 16
16. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 5 of 16
17. (down robot1 tile_2-4 tile_1-4)
   deleted: (robot-at robot1 tile_2-4) (clear tile_1-4)
   added: (robot-at robot1 tile_1-4) (clear tile_2-4)
   goals met: 5 of 16
18. (paint-up robot1 tile_2-4 tile_1-4 white)
   deleted: (clear tile_2-4)
   added: (painted tile_2-4 white)
   goals met: 6 of 16
19. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 6 of 16
20. (down robot1 tile_1-4 tile_0-4)
   deleted: (robot-at robot1 tile_1-4) (clear tile_0-4)
   added: (robot-at robot1 tile_0-4) (clear tile_1-4)
   goals met: 6 of 16
21. (paint-up robot1 tile_1-4 tile_0-4 black)
   deleted: (clear tile_1-4)
   added: (painted tile_1-4 black)
   goals met: 7 of 16
22. (left robot1 tile_0-4 tile_0-3)
   deleted: (robot-at robot1 tile_0-4) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_0-4)
   goals met: 7 of 16
23. (right robot2 tile_2-1 tile_2-2)
   deleted: (robot-at robot2 tile_2-1) (clear tile_2-2)
   added: (robot-at robot2 tile_2-2) (clear tile_2-1)
   goals met: 7 of 16
24. (up robot2 tile_2-2 tile_3-2)
   deleted: (robot-at robot2 tile_2-2) (clear tile_3-2)
   added: (robot-at robot2 tile_3-2) (clear tile_2-2)
   goals met: 7 of 16
25. (paint-up robot2 tile_4-2 tile_3-2 white)
   deleted: (clear tile_4-2)
   added: (painted tile_4-2 white)
   goals met: 8 of 16
26. (down robot2 tile_3-2 tile_2-2)
   deleted: (robot-at robot2 tile_3-2) (clear tile_2-2)
   added: (robot-at robot2 tile_2-2) (clear tile_3-2)
   goals met: 8 of 16
27. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 8 of 16
28. (paint-up robot2 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 9 of 16
29. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 9 of 16
30. (up robot1 tile_0-3 tile_1-3)
   deleted: (robot-at robot1 tile_0-3) (clear tile_1-3)
   added: (robot-at robot1 tile_1-3) (clear tile_0-3)
   goals met: 9 of 16
31. (down robot2 tile_2-2 tile_1-2)
   deleted: (robot-at robot2 tile_2-2) (clear tile_1-2)
   added: (robot-at robot2 tile_1-2) (clear tile_2-2)
   goals met: 9 of 16
32. (paint-up robot2 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 10 of 16
33. (down robot2 tile_1-2 tile_0-2)
   deleted: (robot-at robot2 tile_1-2) (clear tile_0-2)
   added: (robot-at robot2 tile_0-2) (clear tile_1-2)
   goals met: 10 of 16
34. (up robot1 tile_1-3 tile_2-3)
   deleted: (robot-at robot1 tile_1-3) (clear tile_2-3)
   added: (robot-at robot1 tile_2-3) (clear tile_1-3)
   goals met: 10 of 16
35. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 10 of 16
36. (paint-up robot2 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 11 of 16
37. (left robot2 tile_0-2 tile_0-1)
   deleted: (robot-at robot2 tile_0-2) (clear tile_0-1)
   added: (robot-at robot2 tile_0-1) (clear tile_0-2)
   goals met: 11 of 16
38. (down robot1 tile_2-3 tile_1-3)
   deleted: (robot-at robot1 tile_2-3) (clear tile_1-3)
   added: (robot-at robot1 tile_1-3) (clear tile_2-3)
   goals met: 11 of 16
39. (up robot2 tile_0-1 tile_1-1)
   deleted: (robot-at robot2 tile_0-1) (clear tile_1-1)
   added: (robot-at robot2 tile_1-1) (clear tile_0-1)
   goals met: 11 of 16
40. (paint-up robot2 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 12 of 16
41. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 12 of 16
42. (down robot2 tile_1-1 tile_0-1)
   deleted: (robot-at robot2 tile_1-1) (clear tile_0-1)
   added: (robot-at robot2 tile_0-1) (clear tile_1-1)
   goals met: 12 of 16
43. (paint-up robot2 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 13 of 16
44. (up robot1 tile_1-3 tile_2-3)
   deleted: (robot-at robot1 tile_1-3) (clear tile_2-3)
   added: (robot-at robot1 tile_2-3) (clear tile_1-3)
   goals met: 13 of 16
45. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 13 of 16
46. (paint-up robot1 tile_3-3 tile_2-3 white)
   deleted: (clear tile_3-3)
   added: (painted tile_3-3 white)
   goals met: 14 of 16
47. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 14 of 16
48. (down robot1 tile_2-3 tile_1-3)
   deleted: (robot-at robot1 tile_2-3) (clear tile_1-3)
   added: (robot-at robot1 tile_1-3) (clear tile_2-3)
   goals met: 14 of 16
49. (paint-up robot1 tile_2-3 tile_1-3 black)
   deleted: (clear tile_2-3)
   added: (painted tile_2-3 black)
   goals met: 15 of 16
50. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 15 of 16
51. (down robot1 tile_1-3 tile_0-3)
   deleted: (robot-at robot1 tile_1-3) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_1-3)
   goals met: 15 of 16
52. (paint-up robot1 tile_1-3 tile_0-3 white)
   deleted: (clear tile_1-3)
   added: (painted tile_1-3 white)
   goals met: 16 of 16
